app/controllers/school_classes_controller.rb

    def update
        @school_class = SchoolClass.find(params[:id])
        @school_class.update
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Software"], ["room_number", 75], ["updated_at", "2021-09-24 00:47:53.809834"], ["id", 4]]